Repository: Kostenkov-2021/enhanced-control-support-Russian-Locale
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ru

source: Press
ru: Нажать

source: Use normal add-on behavior
ru: Использовать обычное поведение дополнения

source: Use normal NVDA behavior
ru: Использовать обычное поведение NVDA

source: Select control type
ru: Выберите тип элемента управления

source: Select a control type. NVDA will behave as if
ru: Выберите тип элемента управления. NVDA будет вести себя так, как если бы

source: and all similar controls in the same program are the control type you selected, for example, if you select button, all similar controls will be treated as buttons
ru: и все аналогичные элементы управления в одной и той же программе соответствуют выбранному вами типу элемента управления, например, если вы выберете кнопку, все аналогичные элементы управления будут рассматриваться как кнопки

source: Control type:
ru: Тип элемента управления:

source: rely on events. Only change if you know what you are doing
ru: полагаться на события. Меняйте только в том случае, если вы знаете, что делаете

source: Temporarily use normal add-on behavior for all controls
ru: Временно использовать обычное поведение дополнения для всех элементов управления

source: Lets you choose from a list of controls how NVDA will treat the control with focus. For example, choos 'button' To tell NVDA to treat it as a button.
ru: Позволяет выбрать из списка элементов управления, как NVDA будет обрабатывать элемент управления в фокусе. Например, выберите "кнопка", чтобы указать NVDA обрабатывать его как кнопку.

source: You can not assign another control type to this object, because it has no assosiation with a control in Windows
ru: Вы не можете назначить этому объекту другой тип элемента управления, поскольку он не связан с элементом управления в Windows

source: You can not assign another control type to any object contained within NVDA, because if done wrong, you may not be able to reverse the changes you have made
ru: Вы не можете назначить другой тип элемента управления ни одному объекту, содержащемуся в NVDA, поскольку, если это будет сделано неправильно, вы не сможете отменить внесённые изменения

source: Lets you choose from a list of controls how NVDA will treat the control where the navigator object is located. For example, choos 'button' To tell NVDA to treat it as a button.
ru: Позволяет выбрать из списка элементов управления, как NVDA будет обрабатывать элемент управления, на котором расположен объект навигатора. Например, выберите "кнопка", чтобы указать NVDA обрабатывать его как кнопку.

source: Tries to find out an report the type of the control with focus. If pressed twice, information about the control where the navigator object is located will be reported instead
ru: Пытается определить тип элемента управления в фокусе. Если нажать дважды, вместо этого будет отображена информация об элементе управления, на котором находится объект навигатора

source: Unable to find control type
ru: Не удаётся найти тип элемента управления

source: Enhanced Control Support
ru: Расширенная поддержка элементов управления

source: Rely on events by default
ru: Полагаться на события по умолчанию

source: Use enhanced methods to detect where the focus is located (experimental)
ru: Использовать усовершенствованные методы для определения местоположения фокуса (экспериментально).

source: display text edit
ru: редактирование отображаемого текста

source: list box
ru: список

source: enhanced UIA
ru: расширенная UIA

source: unlabeled
ru: без метки

source: Select a control type. NVDA will behave as if
ru: Выберите тип элемента управления. NVDA будет вести себя так, как если бы

source: and all similar controls in the same program are the control type you selected, for example, if you select button, all similar controls will be treated as buttons
ru: и все аналогичные элементы управления в одной и той же программе соответствуют выбранному вами типу элемента управления, например, если вы выберете кнопку, все аналогичные элементы управления будут рассматриваться как кнопки

source: Use enhanced typing support
ru: Использовать улучшенную поддержку ввода текста

source: Adds support for more controls in NVDA.
ru: Это дополнение добавляет поддержку большего количества элементов управления в NVDA.
